#Даны строки S, S1 и S2. Заменить в строке S первое вхождение строки S1 на строку S2.

S = input('введите строку: ')
S1 = input('введите подстроку для поиска: ')
S2 = input('введите подстроку для замены: ')
print(S.replace(S1, S2))
